Repository: LMS-Community/slimserver-platforms
Catalog: osx/Preference Pane/*.lproj/Localizable.strings
Languages: dutch, russian

source: Start Server
russian: Запустить сервер

source: Stop Server
russian: Остановить сервер

source: Start Server Description
dutch: Klik op deze knop om de server te starten. Zodra de server is gestart, hebben muzieksystemen toegang tot je muziekcollectie.
russian: Нажмите эту кнопку, чтобы запустить Lyrion Music Server. После запуска медиатека будет доступна для плееров.

source: Stop Server Description
dutch: Klik op deze knop om de server te stoppen. Zodra de server is gestopt, hebben muzieksystemen geen toegang meer tot je muziekcollectie.
russian: Нажмите эту кнопку, чтобы остановить Lyrion Music Server. После остановки медиатека будет недоступна для плееров.

source: Authorization Launch Error
dutch: Kan firmware niet updaten: bestand Update Firmware.sh ontbreekt.
russian: Не удалось обновить микропрограмму: отсутствует файл Update Firmware.sh.

source: Expired Authorization Error
dutch: Kan firmware niet updaten: autorisatie verlopen.
russian: Не удалось обновить микропрограмму: истек срок действия авторизации.

source: Firmware version
dutch: Firmwareversie %@.
russian: Версия микропрограммы %@.

source: Firmware version invalid
dutch: Firmwareversie ongeldig.
russian: Недопустимая версия микропрограммы.

source: An updated Lyrion Music Server version is available and ready to be installed.
russian: Доступна и готова к установке обновленная версия Lyrion Music Server.

source: There's no updated Lyrion Music Server version available.
russian: Нет доступных обновленных версий Lyrion Music Server.

source: Check for update
dutch: Op update controleren
russian: Проверить наличие обновления

source: Download update
dutch: Update downloaden
russian: Загрузить обновление

source: Install update
dutch: Update installeren
russian: Установить обновление

source: The server has to be stopped before running the cleanup. Do you want to stop it now?
dutch: De server moet worden stopgezet, voordat de opschoning wordt uitgevoerd. Wil je deze nu stoppen?
russian: Перед выполнением очистки Lyrion Music Server нужно остановить. Остановить сейчас?

source: Run Cleanup
dutch: Opschoning uitvoeren
russian: Запустить очистку

source: Cancel
dutch: Annuleren
russian: Отмена

source: Not now
dutch: Niet nu
russian: Не сейчас

source: Abort
dutch: Afbreken
russian: Прервать

source: Rescan
dutch: Opnieuw scannen
russian: Повтор сканирования

source: Invalid mysqueezebox.com username or password.
dutch: Gebruikersnaam of wachtwoord van mysqueezebox.com ongeldig.
russian: Недействительные имя пользователя или пароль mysqueezebox.com.

source: The server is stopped
dutch: De server is gestopt
russian: Cервер остановлен

source: The server is running
dutch: De server is actief
russian: Cервер выполняется

source: The server is starting
dutch: De server wordt gestart
russian: Запуск сервер

source: Version x.y.z
dutch: Versie 10.0.3
russian: Версия 9.0.0

source: An updated UE Music Library version is available and ready to be installed.
dutch: Er is een bijgewerkte versie van UE Music Library beschikbaar die direct ge√Ønstalleerd kan worden.

source: There's no updated UE Music Library version available.
dutch: Er is geen bijgewerkte versie van UE Music Library beschikbaar.
