<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3c.org/TR/1999/REC-html401-19991224/loose.dtd">
<!-- saved from url=(0089)http://svn.slimdevices.com/*checkout*/branches/7.0/platforms/win32/Getting%20Started.html -->
<HTML><HEAD><TITLE>Gu&iacute;a r&aacute;pida de SqueezeCenter versi&oacute;n 7.0a1</TITLE>
<META http-equiv=Content-Type content="text/html; charset=UTF-8">
<META http-equiv=Content-Style-Type content=text/css>
<META content="MSHTML 6.00.2900.3059" name=GENERATOR>
<META content=824.42 name=CocoaVersion>
<STYLE type=text/css>H1 {
	MARGIN: 0px 0px 7px; FONT: bold 11px Verdana; COLOR: #dd3e25; TEXT-ALIGN: center
}
P.p1 {
	MARGIN: 0px 0px 7px; FONT: 11px Verdana; COLOR: #dd3e25; TEXT-ALIGN: center
}
P.p2 {
	MARGIN: 0px 0px 11px; FONT: 11px Verdana; COLOR: #333333; TEXT-ALIGN: center
}
P.p3 {
	MARGIN: 0px 0px 11px; FONT: 11px Verdana; COLOR: #333333
}
P.p4 {
	FONT: bold 11px Verdana; COLOR: #333333
}
P.p5 {
	MARGIN: 0px; FONT: 11px Verdana; COLOR: #333333
}
P.p6 {
	MIN-HEIGHT: 14px; MARGIN: 0px 0px 6px; FONT: 12px Verdana
}
P.p7 {
	MIN-HEIGHT: 13px; MARGIN: 0px; FONT: 11px Verdana; COLOR: #333333
}
P.p8 {
	MARGIN: 0px; FONT: 11px Verdana
}
P.p9 {
	MIN-HEIGHT: 14px; MARGIN: 0px; FONT: 12px Verdana
}
SPAN.s1 {
	TEXT-DECORATION: underline
}
SPAN.s2 {
	COLOR: #0020de; TEXT-DECORATION: underline
}
LI.l1 {
	MARGIN: 0px 0px 3px; FONT: 11px Verdana; COLOR: #333333
}
LI.l2 {
	MARGIN: 0px 0px 11px; FONT: 11px Verdana; COLOR: #333333
}
</STYLE>
</HEAD>
<BODY>
<H1>Gu&iacute;a r&aacute;pida de SqueezeCenter</H1>
<P class=p2>Versi&oacute;n 7.0a1</P>
<P class=p3>Gracias por haber descargado la &uacute;ltima versi&oacute;n de SqueezeCenter para Windows. Para m&aacute;s informaci&oacute;n sobre cada uno de los temas, despl&aacute;cese hacia abajo o haga clic en los siguientes enlaces</P>
<UL>
  <LI class=l1><SPAN class=s1><A 
  href="http://svn.slimdevices.com/*checkout*/branches/7.0/platforms/win32/Getting%20Started.html#Install">Despu&eacute;s de la instalaci&oacute;n</A></SPAN> 
  <LI class=l1><SPAN class=s1><A 
  href="http://svn.slimdevices.com/*checkout*/branches/7.0/platforms/win32/Getting%20Started.html#WhatsNew">Novedades</A></SPAN> 
  <LI class=l1><SPAN class=s1><A 
  href="http://svn.slimdevices.com/*checkout*/branches/7.0/platforms/win32/Getting%20Started.html#Firmware">Actualizaci&oacute;n de firmware</A></SPAN> 
  <LI class=l1><SPAN class-?s1?><A 
  href="http://svn.slimdevices.com/*checkout*/branches/7.0/platforms/win32/Getting%20Started.html#RemoteProblem">Introducir una contrase&ntilde;a WPA con el mando a distancia</A></SPAN> 
  <LI class=l1><SPAN class=s1><A 
  href="http://svn.slimdevices.com/*checkout*/branches/7.0/platforms/win32/Getting%20Started.html#iTunes">Informaci&oacute;n iTunes</A></SPAN> 
  <LI class=l2><SPAN class=s1><A 
  href="http://svn.slimdevices.com/*checkout*/branches/7.0/platforms/win32/Getting%20Started.html#Streaming">Streaming y playback de m&uacute;sica por Internet</A></SPAN> </LI></UL>
<P class=p3>Para cualquier duda o problema, consulte la interfaz Web de SqueezeCenter o visite la secci&oacute;n <A  href="http://www.slimdevices.com/redir.html?http://slimdevices.custhelp.com/cgi-bin/slimdevices.cfg/php/enduser/std_alp.php"><SPAN  class=s2>FAQ</SPAN></A>, nuestro <A  href="http://forums.slimdevices.com/"><SPAN class=s2> foro de usuarios</SPAN></A>, o contacte con nuestro equipo de soporte t&eacute;cnico por e-mail: <A href="mailto:support@slimdevices.com"><SPAN  class=s2>support@slimdevices.com</SPAN></A>.</P>
<P class=p3>Muchas gracias,</P>
<P class=p3>el equipo de sistemas de media streaming de Logitech.</P>
<P class=p4><B><A name=Installation></A>Despu&eacute;s de la instalaci&oacute;n</B></P>
<P class=p3>Si desea abrir una ventana de navegaci&oacute;n para SqueezeCenter, haga clic dos veces en el icono SqueezeCenter de la bandeja de tareas de Windows, que figura en la esquina inferior de la pantalla.</P>
<P class=p3>Haga clic derecho en el icono de la bandeja de tareas para lanzar o detener el servicio de m&uacute;sica de fondo SqueezeCenter. 
<P class=p3>Si utiliza la librer&iacute;a iTunes de Apple para gestionar su m&uacute;sica, SqueezeCenter importar&aacute; autom&aacute;ticamente toda la informaci&oacute;n de su librer&iacute;a iTunes. Si usa iTunes para a&ntilde;adir o eliminar m&uacute;sica en su librer&iacute;a, SqueezeCenter registrar&aacute; dicho cambio y actualizar&aacute; la informaci&oacute;n musical.</P><A 
name=WhatsNew>
<P class=p4>Novedades de la versi&oacute;n 7.0a1</P></A>
<P class=p3>La versi&oacute;n 7.0a1 de SqueezeCenter incorpora una gran cantidad de mejoras. La siguiente lista incluye &uacute;nicamente los cambios m&aacute;s destacables que se reflejan en la pantalla del usuario o que cambian o mejoran la forma de interactuar con su Squeezebox o Transporter. Para m&aacute;s informaci&oacute;n, consulte la <A  href="http://svn.slimdevices.com/*checkout*/branches/7.0/server/Changelog6.html">lista completa</SPAN></A> de los cambios.</P>
<UL>
  <LI class=l1>Localizado en 6 idiomas: ingl&eacute;s, alem&aacute;n, franc&eacute;s, espa&ntilde;ol, italiano, holand&eacute;s y hebreo, incluidos los instaladores de Mac y Windows. Pueden a&ntilde;adirse otros idiomas en versiones posteriores. Si est&aacute; interesado en nuestros &uacute;tiles servicios de localizaci&oacute;n, que incluyen traducciones o pruebas en los idiomas nativos, contacte con nuestro equipo de ingenier&iacute;a por e-mail: <A    href="mailto:developers@slimdevices.com"><SPAN    class=s2>developers@slimdevices.com</SPAN></A>. 
  <LI class=l1>Se ha cambiado el control de volumen para Squeezebox, Squeezebox2 y Squeezebox v3 para una escala de 0 a 100. 
  <LI class=l1>Se ha aumentado la capacidad para guardar &Aacute;lbum, Artista, G&eacute;nero y A&ntilde;o en Favoritos. 
  <LI class=l1>Se han introducido varios cambios para mejorar el modo en que SqueezeCenter busca la m&uacute;sica en la librer&iacute;a, como, por ejemplo, buscar s&oacute;lo los archivos modificados desde la &uacute;ltima b&uacute;squeda y buscar s&oacute;lo los archivos existentes en el disco duro pero no en la base de datos SqueezeCenter. 
  <LI class=l1>Como Squeezeboxes no puede reproducir m&uacute;sica que utilice la tecnolog&iacute;a de gesti&oacute;n de derechos digitales (DRM), como el Plays for Sure de Microsoft o el FairPlay de Apple, las canciones con DRM de su librer&iacute;a de m&uacute;sica local no se pueden incluir en la base de datos SqueezeCenter. 
  <LI class=l1>Ahora, Squeezebox2 y Squeezebox v3 permiten reproducir de forma nativa OGG. 
  <LI class=l1>Se ha cambiado la forma de b&uacute;squeda en las listas num&eacute;ricas.  Es la misma para las listas de 10 &oacute; menos elementos (las teclas de 1 a 9 llevan directamente al n&uacute;mero correspondiente, mientras que la tecla 0 lleva al 10). Para las listas m&aacute;s largas, cada tecla pulsada es a&ntilde;adida a la b&uacute;squeda; por ejemplo, al pulsar las teclas 1, 4, 2, se va primero al elemento 1, luego al 14 y, por &uacute;ltimo, al elemento 142 de la lista. 
  <LI class=l1>Si un usuario pierde la conexi&oacute;n con el servidor, la pantalla se pone en blanco en vez de mostrar un mensaje de error.  Para visualizar el mensaje de error, basta con pulsar cualquier bot&oacute;n del mando a distancia. De esta manera, los usuarios no son despertados en mitad de la noche con un mensaje de error luminoso. 
  <LI class=l2>Para los propietarios de Transporter, se ha mejorado el funcionamiento de la ruedecilla TransNav. </LI></UL><A name=Firmware>
<P class=p4>Actualizaci&oacute;n de firmware</A></P>
<P class=p3>Si es usted propietario de Squeezebox o Transporter, seguramente tendr&aacute; que actualizar su firmware cuando lo conecte por primera vez a SqueezeCenter. Pulse y mantenga pulsado el bot&oacute;n Brightness del mando a distancia hasta que empiece la actualizaci&oacute;n del firmware.</P><A name=RemoteProblem>
<P class=p4>Introducir una contrase&ntilde;a WPA con el mando a distancia</P></A>
<P class=p3>La Gu&iacute;a de usuario de Squeezebox y Transporter incluye un error en la secci&oacute;n de contrase&ntilde;as WPA. Seg&uacute;n el manual, para a&ntilde;adir un car&aacute;cter hay que pulsar el bot&oacute;n PLAY y el bot&oacute;n ADD para eliminarlo. Pero se contradice con la pr&aacute;ctica. El manual deber&iacute;a indicar en realidad que el bot&oacute;n ADD permite a&ntilde;adir un car&aacute;cter y el bot&oacute;n PLAY eliminarlo.</P><A name=iTunes>
<P class=p4>Soporte para su librer&iacute;a iTunes</A></P>
<P class=p3>Si utiliza la librer&iacute;a iTunes de Apple para gestionar su m&uacute;sica, SqueezeCenter importar&aacute; autom&aacute;ticamente toda la informaci&oacute;n de su librer&iacute;a iTunes. Si usa iTunes para a&ntilde;adir o eliminar m&uacute;sica en su librer&iacute;a, SqueezeCenter registrar&aacute; dicho cambio y actualizar&aacute; la informaci&oacute;n musical.</P>
<P class=p8>Si no desea que SqueezeCenter emplee la informaci&oacute;n iTunes, tendr&aacute; que especificar una carpeta concreta para su librer&iacute;a musical. Para ello, lance la interfaz Web de SqueezeCenter, haga clic en Ajustes del servidor y especifique la carpeta dedicada a su m&uacute;sica. Para a&ntilde;adir o eliminar m&uacute;sica en su librer&iacute;a, tendr&aacute; que iniciar manualmente la actualizaci&oacute;n. Para ello, visite la p&aacute;gina Ajustes del servidor de la interfaz Web de SqueezeCenter y haga clic en Actualizar.</P>
<P class=p4>Breve comentario sobre las canciones compradas en la tienda de m&uacute;sica iTunes</P>
<P class=p3>Apple protege la mayor&iacute;a de las canciones vendidas en la tienda de m&uacute;sica iTunes mediante la gesti&oacute;n de derechos digitales (DRM), por lo que tales archivos tienen derechos de usuario limitados. Un derecho importante que Apple no garantiza es el derecho de reproducir tales canciones con un dispositivo de m&uacute;sica no suministrado por Apple (salvo el ordenador desde el que compr&oacute; dichas canciones). Hasta que Apple no cambie su pol&iacute;tica de licencias o elimine el uso del FairPlay, usted no podr&aacute; reproducir tales canciones con Squeezebox ni con Transporter.</P>
<P class=p4>Algunas canciones de la librer&iacute;a iTunes no aparecen en SqueezeCenter o no se pueden leer.</P>
<P class=p3>Si ha cambiado de lugar sus archivos de m&uacute;sica iTunes, este sistema puede exportar a su librer&iacute;a informaci&oacute;n err&oacute;nea sobre las canciones. Aseg&uacute;rese por tanto de que iTunes dispone de la carpeta correcta para su librer&iacute;a de m&uacute;sica.</P>
<P class=p3>Visite las Preferencias de iTunes y haga clic en Avanzadas. Compruebe que el camino indicado hacia su carpeta de librer&iacute;a de m&uacute;sica es el correcto. En caso contrario, corr&iacute;jalo. Si es el correcto, trate de cambiarlo hacia otra carpeta y luego dir&iacute;jalo de nuevo a la carpeta correcta. Entonces, iTunes actualizar&aacute; los caminos hacia toda su m&uacute;sica y exportar&aacute; los datos correctamente. (Este proceso no cambiar&aacute; su m&uacute;sica almacenada, pero har&aacute; que iTunes explore su librer&iacute;a de m&uacute;sica y actualice los caminos hacia las canciones.)</P>
<P class=p3>Si el problema persiste, iTunes puede confundirse si usted cambia los ajustes &quot;Mantener organizada la carpeta iTunes Music&quot; o &quot;A&ntilde;adir n&uacute;mero de pista&quot; en iTunes. Trate de cambiar estos ajustes y luego vu&eacute;lvalos a modificar para que iTunes actualice la informaci&oacute;n correcta sobre sus archivos de m&uacute;sica. Atenci&oacute;n: si utiliza iTunes para organizar sus archivos de m&uacute;sica, tal vez tenga que desplazar o renombrar tales archivos.</P><A name=Streaming>
<P class=p4>Streaming y playback de m&uacute;sica por Internet</A></P>
<P class=p3>SqueezeCenter ha sido dise&ntilde;ado para reproducir m&uacute;sica en formato MP3 mediante un reproductor de m&uacute;sica online Squeezebox, Transporter o SLIMP3. Adem&aacute;s, ofrece la ventaja de que tambi&eacute;n puede reproducir los archivos MP3 por Internet con cualquier reproductor de m&uacute;sica que soporte la tecnolog&iacute;a MP3 streaming.</P>
<P class=p3>Primero, instale el software SqueezeCenter y aseg&uacute;rese de que el ordenador que vaya a utilizar como SqueezeCenter tenga conexi&oacute;n a Internet. En caso contrario, busque un puerto 9000 en su router para el ordenador SqueezeCenter. (Consulte las instrucciones de uso del router). Luego:</P>
<UL>
  <LI class=l1>Utilice su software reproductor MP3 para abrir una v&iacute;a de acceso a la URL: <A    href="http://localhost:9000/stream.mp3"><SPAN    class=s2>http://localhost:9000/stream.mp3</SPAN></A>. (Vuelva a poner &quot;localhost&quot; en la direcci&oacute;n IP del ordenador SqueezeCenter). Si usa la seguridad de contrase&ntilde;a de SqueezeCenter, tendr&aacute; que utilizar una URL ligeramente modificada, como por ejemplo: <A href="http://username:password@localhost:9000/stream.mp3"><SPAN    class=s2>http://username:password@localhost:9000/stream.mp3</SPAN></A>. Para algunos reproductores MP3, tendr&aacute; que introducir su nombre de usuario y su contrase&ntilde;a. 
  <LI class=l1>Lance la interfaz Web de SqueezeCenter que se est&eacute; ejecutando en el ordenador remoto abriendo la p&aacute;gina Web <A href="http://localhost:9000/"><SPAN    class=s2>http://localhost:9000</SPAN></A> (Vuelva a poner &quot;localhost&quot; en la direcci&oacute;n IP del ordenador remoto). Advertir&aacute; la presencia de un nuevo &quot;reproductor&quot; correspondiente a la direcci&oacute;n IP del ordenador con el software reproductor MP3. 
  <LI class=l1>Use el panel izquierdo de la interfaz Web de SqueezeCenter para explorar y seleccionar los archivos y listas de reproducci&oacute;n que desee editar. Una vez seleccionada la m&uacute;sica, &eacute;sta aparecer&aacute; en el panel derecho de la interfaz Web. 
  <LI class=l1>Para editar la m&uacute;sica, haga clic en &quot;Play&quot;, en el panel derecho de la interfaz Web de SqueezeCenter. 
  <LI class=l1>Al cabo de unos segundos, se oir&aacute; la m&uacute;sica emitida por el software reproductor MP3.   (Este tiempo de espera corresponde al buffering registrado en su software reproductor MP3). 
  <LI class=l2>Si lo desea, puede cambiar el contenido que se est&aacute; reproduciendo a trav&eacute;s de la interfaz Web de SqueezeCenter del ordenador remoto. </LI></UL>
<P class=p2>Copyright 2003-2007, Logitech, Inc. Todos los derechos reservados.</P></BODY></HTML>
