<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
  <meta http-equiv="Content-Style-Type" content="text/css">
  <title>
	Guide de d&eacute;marrage du SqueezeCenter version 7.0.0
  </title>
  <meta name="Generator" content="Cocoa HTML Writer">
  <meta name="CocoaVersion" content="824.42">
  <style type="text/css">
    h1 {margin: 0.0px 0.0px 7.0px 0.0px; text-align: center; font: 11.0px Verdana; font-weight: bold; color: #dd3e25}
    p.p1 {margin: 0.0px 0.0px 7.0px 0.0px; text-align: center; font: 11.0px Verdana; color: #dd3e25}
    p.p2 {margin: 0.0px 0.0px 11.0px 0.0px; text-align: center; font: 11.0px Verdana; color: #333333}
    p.p3 {margin: 0.0px 0.0px 11.0px 0.0px; font: 11.0px Verdana; color: #333333}
    p.p4 {margin: 20.0px 0.0px 5.0px .0px; font: 11.0px Verdana; font-weight: bold; color: #333333}
    p.p5 {margin: 0.0px 0.0px 0.0px 0.0px; font: 11.0px Verdana; color: #333333}
    p.p6 {margin: 0.0px 0.0px 6.0px 0.0px; font: 12.0px Verdana; min-height: 14.0px}
    p.p7 {margin: 0.0px 0.0px 0.0px 0.0px; font: 11.0px Verdana; color: #333333; min-height: 13.0px}
    p.p8 {margin: 0.0px 0.0px 0.0px 0.0px; font: 11.0px Verdana}
    p.p9 {margin: 0.0px 0.0px 0.0px 0.0px; font: 12.0px Verdana; min-height: 14.0px}
    span.s1 {text-decoration: underline}
    span.s2 {text-decoration: underline ; color: #0020de}
    li.l1 {margin: 0.0px 0.0px 3.0px 0.0px; font: 11.0px Verdana; color: #333333}
    li.l2 {margin: 0.0px 0.0px 11.0px 0.0px; font: 11.0px Verdana; color: #333333}
  </style>
</head>
<body>

<h1>Guide de d&eacute;marrage du SqueezeCenter</h1>
<p class="p2">Version 7.0.0</p>

<p class="p3">Merci d'avoir t&eacute;l&eacute;charg&eacute; la derni&egrave;re version du SqueezeCenter pour Microsoft Windows. Vous pouvez parcourir le fichier ou cliquer sur les liens suivants pour acc&eacute;der &agrave; chaque rubrique.</p>
<ul>
  <li class="l1"><span class="s1"><a href="#Install">Installation du SqueezeCenter</a></span></li>
  <li class="l1"><span class="s1"><a href="#WhatsNew">Nouveaut&eacute;s</a></span></li>
  <li class="l1"><span class="s1"><a href="#ServiceMode">Ex&eacute;cution du SqueezeCenter en tant que service</a></span></li>
  <li class="l1"><span class="s1"><a href="#Firmware">Mise &agrave; jour du micrologiciel</a></span></li>
  <li class="l1"><span class="s1"><a href="#RemoteProblem">Saisie d'un mot de passe WPA &agrave; l'aide de la t&eacute;l&eacute;commande</a></span></li>
  <li class="l1"><span class="s1"><a href="#iTunes">Informations sur iTunes</a></span></li>
  <li class="l2"><span class="s1"><a href="#Streaming">Diffusion de musique sur Internet</a></span></li>
</ul>
<p class="p3">Si vous avez des questions ou en cas de probl&egrave;me, reportez-vous &agrave; l'interface Web du SqueezeCenter, consultez les <a href="http://slimdevices.custhelp.com/cgi-bin/slimdevices.cfg/php/enduser/std_alp.php"><span class="s2">Questions fr&eacute;quentes</span></a>, rendez-vous sur les forums utilisateurs &agrave; l'adresse <a href="http://forums.slimdevices.com/"><span class="s2">http://forum.slimdevices.com/</span></a> ou contactez le support technique &agrave; l'adresse suivante: <a href="mailto:support@slimdevices.com"><span class="s2">support@slimdevices.com</span></a>.</p>
<p class="p3">Merci.</p>
<p class="p3">L'&eacute;quipe des syst&egrave;mes multim&eacute;dia de diffusion Logitech</p>


<a NAME="Install"><p class="p4">Installation</p></a>
<p class="p3">Pour installer le SqueezeCenter, cliquez deux fois sur <b>le fichier d'installation</b> et suivez les instructions &agrave; l'&eacute;cran. Le programme d'installation vous avertira une fois l'installation termin&eacute;e. Le SqueezeCenter pour Windows est install&eacute; comme une application par d&eacute;faut (pour en savoir plus sur l'ex&eacute;cution du SqueezeCenter en tant que service, <span class="s1"><a href="#ServiceMode">reportez-vous &agrave; la section suivante</a></span>). Cliquez deux fois sur l'ic&ocirc;ne du SqueezeCenter dans la barre d'&eacute;tat syst&egrave;me Windows pour d&eacute;marrer l'interface Web du serveur.</p>
<p class="p3">Lors de la premi&egrave;re ex&eacute;cution, un assistant vous guide dans la proc&eacute;dure de configuration du SqueezeCenter pour votre syst&egrave;me.</p>
<p class="p3">Si vous effectuez une mise &agrave; niveau d'une ancienne version du SlimServer vers le SqueezeCenter, les param&egrave;tres du SlimServer seront conserv&eacute;s.  Cependant, en raison des modifications apport&eacute;es &agrave; l'architecture des extras, vous devrez t&eacute;l&eacute;charger et installer des versions mises &agrave; jour.  Les r&eacute;glages sp&eacute;cifiques aux extras ne seront pas conserv&eacute;s automatiquement.  Pour en savoir plus sur les extras, rendez-vous sur <a href="http://wiki.slimdevices.com/index.cgi?SlimServerPlugins"><span class="s2">notre wiki</span></a>.</p>
<p class="p3">Vous pouvez obtenir des informations sur l'utilisation du serveur dans l'aide du SqueezeCenter en s&eacute;lectionnant l'ic&ocirc;ne Aide dans la partie inf&eacute;rieure gauche de l'interface Web.</p>


<a NAME="WhatsNew"><p class="p4">Nouveaut&eacute;s de la version 7.0.0</p></a>
<p class="p3">Le SqueezeCenter version 7.0.0 contient des modifications importantes, parmi lesquelles un changement de nom. La liste suivante r&eacute;pertorie les modifications les plus importantes qui ont un impact sur ce que vous voyez &agrave; l'&eacute;cran ou qui permettent d'am&eacute;liorer la mani&egrave;re dont vous utiliser la Squeezebox ou Transporter. Une <a href="http://svn.slimdevices.com/*checkout*/trunk/server/Changelog7.html"><span class="s2">liste compl&egrave;te</span></a> des modifications est &eacute;galement disponible.</p>
<ul>
  <li class="l1">Le SlimServer a &eacute;t&eacute; renomm&eacute; SqueezeCenter dans un souci de coh&eacute;rence avec le nom du produit.</li>
  <li class="l1">Le SqueezeCenter est dot&eacute; d'une nouvelle interface, qui comprend une page de r&eacute;glages avec des onglets, afin de simplifier la configuration.  Si vous pr&eacute;f&eacute;rez l'ancienne apparence, l'interface du SlimServer 6.5.x a &eacute;t&eacute; renomm&eacute;e Classic et vous pouvez y acc&eacute;der par le biais de l'adresse <b>http://<i>IP du serveur</i>:9000/classic</b>.
  <li class="l1">SqueezeNetwork a &eacute;t&eacute; int&eacute;gr&eacute; au SqueezeCenter. Vous n'avez plus besoin de basculer entre les deux pour acc&eacute;der &agrave; des services sur Internet ou &agrave; votre collection musicale.  Les services tels que Pandora Radio, Rhapsody et Slacker Radio sont maintenant accessibles directement &agrave; partir d'une Squeezebox ou Transporter reli&eacute;s au SqueezeCenter. </li>
  <li class="l1">La synchronisation de plusieurs Squeezeboxes ou Transporters a &eacute;t&eacute; recon&ccedil;ue et am&eacute;lior&eacute;e.</li>
  <li class="l1">La prise en charge de dispositifs SqueezeOS a &eacute;t&eacute; ajout&eacute;e.  SqueezeOS est le nouveau nom de la plate-forme Jive.</li>
  <li class="l1">L'architecture des extras a &eacute;t&eacute; modifi&eacute;e pour cr&eacute;er une interface robuste et coh&eacute;rente.  Il est cependant n&eacute;cessaire de mettre &agrave; jour les extras de la version SlimServer 6.5 pour qu'ils soient compatibles avec le SqueezeCenter.  Pour en savoir plus, reportez-vous &agrave; <a href="http://wiki.slimdevices.com/index.cgi?SlimServerPlugins"><span class="s2">la section correspondante sur le wiki</span></a>.</li>
</ul>


<a NAME="ServiceMode"><p class="p4">Ex&eacute;cution du SqueezeCenter en tant que service</a></p>
<p class="p3">Par d&eacute;faut, le SqueezeCenter est ex&eacute;cut&eacute; en mode application et d&eacute;marre &agrave; l'ouverture de la session Windows.  Le serveur peut ainsi acc&eacute;der &agrave; votre biblioth&egrave;que iTunes, &agrave; vos dossiers partag&eacute;s ou &agrave; vos lecteurs en r&eacute;seau sans modifier son comportement.  Si vous souhaitez ex&eacute;cuter le SqueezeCenter en tant que service en arri&egrave;re-plan sous Windows, <b>activez le service SqueezeCenter</b>.  S&eacute;lectionnez <b>Gestionnaire de d&eacute;marrage</b> sous SqueezeCenter dans le menu D&eacute;marrer de Windows.</p>
<ul>
  <li class="l1">Pour ex&eacute;cuter le SqueezeCenter en tant que service, s&eacute;lectionnez <b>D&eacute;marrer le SqueezeCenter automatiquement au d&eacute;marrage de l'ordinateur</b>. Le SqueezeCenter sera install&eacute; en tant que service.</li>
  <li class="l2">Pour ex&eacute;cuter le SqueezeCenter en tant qu'application, s&eacute;lectionnez <b>D&eacute;marrer le SqueezeCenter &agrave; l'&amp;ouverture de session</b>. Le SqueezeCenter sera ex&eacute;cut&eacute; en tant qu'application (configuration par d&eacute;faut).</li>
</ul>
<p class="p3">Si le SqueezeCenter est ex&eacute;cut&eacute; en tant que service en arri&egrave;re-plan, vous devez sp&eacute;cifier votre nom d'utilisateur et votre mot de passe Windows pour autoriser le serveur &agrave; acc&eacute;der &agrave; votre biblioth&egrave;que iTunes, aux dossier partag&eacute;s et aux lecteurs en r&eacute;seau.  Utilisez le bouton <b>Suivant</b> pour accepter les modifications et pour quitter l'application.  Vous devez red&eacute;marrer Windows pour appliquer les modifications.</p>


<a NAME="Firmware"><p class="p4">Mise &agrave; jour du micrologiciel</a></p>
<p class="p3">Si vous poss&eacute;dez une Squeezebox ou un Transporter, un message vous demandant de mettre &agrave; jour le micrologiciel peut s'afficher lors de la premi&egrave;re connexion au SqueezeCenter. Maintenez le bouton Brightness de la t&eacute;l&eacute;commande enfonc&eacute; jusqu'&agrave; ce que la mise &agrave; jour d&eacute;marre.</p>


<a NAME="RemoteProblem"><p class="p4">Saisie d'un mot de passe WPA &agrave; l'aide de la t&eacute;l&eacute;commande</p></a>
<p class="p3">La section relative aux mots de passe WPA dans certaines versions des guides de l'utilisateur de la Squeezebox et de Transporter contient une erreur.  Selon ces guides, vous devez utiliser le bouton PLAY pour ins&eacute;rer un caract&egrave;re dans la cha&icirc;ne du mot de passe et le bouton ADD pour en supprimer un.  Il faut en r&eacute;alit&eacute; comprendre le contraire.  Le bouton ADD permet d'ins&eacute;rer un caract&egrave;re, et le bouton PLAY d'en supprimer un.</p>


<a NAME="iTunes"><p class="p4">Prise en charge de la biblioth&egrave;que d'iTunes</a></p>
<p class="p3">Si vous utiliser Apple iTunes pour g&eacute;rer votre musique, le SqueezeCenter importe les informations de la biblioth&egrave;que automatiquement. Si vous utilisez iTunes pour ajouter des morceaux &agrave; la biblioth&egrave;que ou pour en supprimer, le SqueezeCenter d&eacute;tecte les modifications apport&eacute;es et analyse &agrave; nouveau la biblioth&egrave;que.  Vous pouvez d&eacute;finir l'intervalle entre les v&eacute;rifications &agrave; partir de l'onglet iTunes sous R&eacute;glages dans l'interface Web du SqueezeCenter.</p>
<p class="p8">Si vous ne souhaitez pas que le SqueezeCenter utilise la base de donn&eacute;es iTunes, vous devez modifier le r&eacute;glage dans l'onglet iTunes.  Vous devez sp&eacute;cifier le dossier dans lequel votre musique et vos listes de lecture sont stock&eacute;es, puis d&eacute;marrer une analyse en s&eacute;lectionnant l'option Analyser dans l'onglet R&eacute;glages de base.</p>

<p class="p4">A propos des morceaux achet&eacute;s sur iTunes Music Store</p>
<p class="p3">Apple utilise le syst&egrave;me de gestion num&eacute;rique des droits (DRM) FairPlay sur la plupart des morceaux vendus sur iTunes Music Store. Les droits des utilisateurs sont par cons&eacute;quent limit&eacute;s sur ces fichiers. Apple n'autorise pas la lecture de tels morceaux sur un p&eacute;riph&eacute;rique non fourni par Apple (&agrave; l'exception de l'ordinateur &agrave; l'aide duquel le morceau a &eacute;t&eacute; achet&eacute;). Par cons&eacute;quent, vous ne pourrez pas lire ces morceaux &agrave; l'aide de la Squeezebox ou de Transporter en raison de ce syst&egrave;me.</p>

<p class="p4">Certains morceaux de la biblioth&egrave;que iTunes ne s'affichent pas dans le SqueezeCenter ou ne peuvent &ecirc;tre ouverts</p>
<p class="p3">Si vous avez d&eacute;plac&eacute; les morceaux, les informations sur la biblioth&egrave;que iTunes risquent d'&ecirc;tre incorrectes. Vous devez sp&eacute;cifier le dossier correct dans iTunes.</p>
<p class="p3">Pour ce faire, acc&eacute;dez aux pr&eacute;f&eacute;rences, puis cliquez sur Avanc&eacute;. Sp&eacute;cifiez le chemin d'acc&egrave;s correct au dossier iTunes Music. S'il est correct, essayez de sp&eacute;cifier un dossier diff&eacute;rent, puis sp&eacute;cifiez &agrave; nouveau le dossier correct. iTunes met ensuite &agrave; jour les chemins d'acc&egrave;s &agrave; tous les morceaux et exporte ces informations de mani&egrave;re ad&eacute;quate. Cette proc&eacute;dure ne d&eacute;place aucun morceau mais force iTunes &agrave; analyser la biblioth&egrave;que musicale et &agrave; mettre &agrave; jour le chemin d'acc&egrave;s aux morceaux.</p>
<p class="p3">Si le probl&egrave;me persiste, la confusion peut provenir des modifications apport&eacute;es aux options Maintenir organis&eacute; le dossier iTunes Music et Cr&eacute;er des noms de fichier avec le num&eacute;ro de piste. Modifiez ces options pour qu'iTunes mette &agrave; jour les informations sur les fichiers musicaux. Notez que le fait de laisser iTunes g&eacute;rer les fichiers musicaux peut impliquer l'attribution d'un nouveau nom aux fichiers ou leur d&eacute;placement.</p>


<a NAME="Streaming"><p class="p4">Diffusion de musique sur Internet</a></p>
<p class="p3">Le SqueezeCenter a &eacute;t&eacute; con&ccedil;u pour diffuser des morceaux au format MP3 vers une platine Squeezebox, Transporter ou SLIMP3 en r&eacute;seau. Il permet &eacute;galement de diffuser vos morceaux sur Internet pour les lecteurs prenant en charge la diffusion de musique &agrave; ce format.</p>
<p class="p3">Installez le SqueezeCenter et v&eacute;rifiez que l'ordinateur sur lequel le serveur est install&eacute; est connect&eacute; &agrave; Internet. Si ce n'est pas le cas, vous devez ouvrir le port&nbsp;9000 sur le routeur vers l'ordinateur sur lequel le SqueezeCenter est install&eacute;. Reportez-vous &agrave; la documentation du routeur pour en savoir plus. Proc&eacute;dez ensuite comme suit.</p>
<ul>
  <li  class="l1">Utilisez le logiciel de lecture de MP3 pour ouvrir un flux &agrave; l'aide de l'URL suivante: <a href="http://localhost:9000/stream.mp3"><span class="s2">http://localhost:9000/stream.mp3</span></a>. Remplacez localhost par l'adresse IP de l'ordinateur du SqueezeCenter. Si vous utilisez un mot de passe pour le SqueezeCenter, vous devez sp&eacute;cifier une URL du type <a href="http://username:password@localhost:9000/stream.mp3"><span class="s2">http://nom_d'utilisateur:mot_de_passe@localhost:9000/stream.mp3</span></a>. Certains logiciels de lecture de MP3 vous invitent &agrave; sp&eacute;cifier un nom d'utilisateur et un mot de passe.</li>
  <li  class="l1">Ouvrez l'interface Web du SqueezeCenter ex&eacute;cut&eacute; sur l'ordinateur distant en ouvrant le navigateur &agrave; la page <a href="http://localhost:9000/"><span class="s2">http://localhost:9000</span></a>. Remplacez localhost par l'adresse IP de l'ordinateur distant. Vous pourrez apercevoir une platine correspondant &agrave; l'adresse IP de l'ordinateur dot&eacute; du logiciel de lecture MP3.</li>
  <li  class="l1">Vous pouvez utiliser le volet de gauche de l'interface Web du SqueezeCenter pour parcourir les fichiers et les listes de lecture et effectuer vos s&eacute;lections. Lorsque vous s&eacute;lectionnez un morceau, celui-ci s'affiche dans le volet de gauche de l'interface Web.</li>
  <li  class="l1">Cliquez sur Lecture dans le volet de droite de l'interface pour lancer la lecture du morceau.</li>
  <li  class="l1">Le logiciel de lecture de MP3 commence &agrave; diffuser le morceau apr&egrave;s quelques secondes. Ce d&eacute;lai est d&ucirc; &agrave; la mise en tampon du morceau par le logiciel de lecture.</li>
  <li  class="l2">Utilisez l'interface Web du SqueezeCenter sur l'ordinateur distant pour changer de morceau.</li>
</ul>
<p class="p2">Copyright 2003-2007 Logitech, Inc. Tous droits r&eacute;serv&eacute;s.</p>
</body>
</html>
