<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
  <meta http-equiv="Content-Style-Type" content="text/css">
  <title>
	Erste Schritte mit SqueezeCenter, Version 7.3

  </title>
  <meta name="Generator" content="Cocoa HTML Writer">
  <meta name="CocoaVersion" content="824.42">
  <style type="text/css">
    h1 {margin: 0.0px 0.0px 7.0px 0.0px; text-align: center; font: 11.0px Verdana; font-weight: bold; color: #dd3e25}
    p.p1 {margin: 0.0px 0.0px 7.0px 0.0px; text-align: center; font: 11.0px Verdana; color: #dd3e25}
    p.p2 {margin: 0.0px 0.0px 11.0px 0.0px; text-align: center; font: 11.0px Verdana; color: #333333}
    p.p3 {margin: 0.0px 0.0px 11.0px 0.0px; font: 11.0px Verdana; color: #333333}
    p.p4 {margin: 20.0px 0.0px 5.0px .0px; font: 11.0px Verdana; font-weight: bold; color: #333333}
    p.p5 {margin: 0.0px 0.0px 0.0px 0.0px; font: 11.0px Verdana; color: #333333}
    p.p6 {margin: 0.0px 0.0px 6.0px 0.0px; font: 12.0px Verdana; min-height: 14.0px}
    p.p7 {margin: 0.0px 0.0px 0.0px 0.0px; font: 11.0px Verdana; color: #333333; min-height: 13.0px}
    p.p8 {margin: 0.0px 0.0px 0.0px 0.0px; font: 11.0px Verdana}
    p.p9 {margin: 0.0px 0.0px 0.0px 0.0px; font: 12.0px Verdana; min-height: 14.0px}
    span.s1 {text-decoration: underline}
    span.s2 {text-decoration: underline ; color: #0020de}
    li.l1 {margin: 0.0px 0.0px 3.0px 0.0px; font: 11.0px Verdana; color: #333333}
    li.l2 {margin: 0.0px 0.0px 11.0px 0.0px; font: 11.0px Verdana; color: #333333}
  </style>
</head>
<body>

<h1>Erste Schritte mit SqueezeCenter</h1>
<p class="p2">Version 7.3</p>


<p class="p3">Vielen Dank, dass Sie die neueste Version von SqueezeCenter f&uuml;r Microsoft Windows heruntergeladen haben. Die folgenden Themen werden beschrieben.</p>
<ul>
  <li class="l1"><span class="s1"><a href="#Install">Installieren von SqueezeCenter</a></span></li>
  <li class="l1"><span class="s1"><a href="#WhatsNew">Neue Funktionen</a></span></li>
  <li class="l1"><span class="s1"><a href="#ServiceMode">Ausf&uuml;hren von SqueezeCenter als Windows-Dienst</a></span></li>
  <li class="l1"><span class="s1"><a href="#Firmware">Aktualisieren der Firmware</a></span></li>
  <li class="l1"><span class="s1"><a href="#RemoteProblem">Eingeben eines WPA-Kennworts &uuml;ber die Fernbedienung</a></span></li>
  <li class="l1"><span class="s1"><a href="#iTunes">Informationen zu iTunes</a></span></li>
  <li class="l2"><span class="s1"><a href="#Streaming">Streaming-Wiedergabe &uuml;ber das Internet</a></span></li>
</ul>
<p class="p3">Wenn Sie Fragen oder Probleme haben, verwenden Sie die SqueezeCenter-Web-Benutzeroberfl&auml;che, lesen Sie die <a href="http://slimdevices.custhelp.com/cgi-bin/slimdevices.cfg/php/enduser/std_alp.php"><span class="s2">FAQ</span></a>, besuchen Sie unser Benutzerforum untere <a href="http://forums.slimdevices.com/"><span class="s2">http://forum.slimdevices.com/</span></a> oder wenden Sie sich an unseren Kundendienst unter <a href="mailto:support@slimdevices.com"><span class="s2">support@slimdevices.com</span></a>.</p>
<p class="p3">Vielen Dank,</p>
<p class="p3">Das Logitech Streaming Media Systems Team</p>


<a NAME="Install"><p class="p4">Installation</p></a>
<p class="p3">Doppelklicken Sie zum Installieren von SqueezeCenter auf das <b>SqueezeCenter-Installationsprogramm</b> und folgen Sie den Anweisungen auf dem Bildschirm. Das Installationsprogramm meldet, wenn die Installation abgeschlossen ist. SqueezeCenter for Windows wird standardm&auml;&szlig;ig als Anwendung installiert. Informationen zum Ausf&uuml;hren von SqueezeCenter als Systemdienst finden Sie <span class="s1"><a href="#ServiceMode">hier</a></span>. Doppeklicken Sie auf das SqueezeCenter-Symbol in der Windows-Taskleiste, um die SqueezeCenter-Web-Benutzeroberfl&auml;che zu starten.</p>
<p class="p3">Wenn Sie die Web-Benutzeroberfl&auml;che zum ersten Mal starten, f&uuml;hrt Sie ein Assistent durch die Konfiguration von SqueezeCenter f&uuml;r Ihren Computer.</p>
<p class="p3">Wenn Sie SlimServer auf SqueezeCenter aufr&uuml;sten, bleiben die Einstellungen aus SlimServer erhalten.  Allerdings m&uuml;ssen Sie aufgrund der ge&auml;nderten Plug-In-Architektur aktualisierte Plug-Ins herunterladen und installieren.  Plug-In-spezifische Einstellungen bleiben nicht automatisch erhalten.  Informationen zu Plug-Ins finden Sie in <a href="http://wiki.slimdevices.com/index.php/SqueezeCenter_Plugins"><span class="s2">unserem Wiki</span></a>:</p>
<p class="p3">Informationen zum Einsatz von SqueezeCenter erhalten Sie, wenn Sie auf das Hilfesymbol unten links in der Web-Benutzeroberfl&auml;che klicken.</p>


<a NAME="WhatsNew"><p class="p4">Neue Funktionen in 7.3</p></a>
<p class="p3">SqueezeCenter Version 7.3 enth&auml;lt bedeutende &Auml;nderungen sowie einen brandneuen Namen! Die folgende Liste enth&auml;lt die wichtigsten &Auml;nderungen, die die Anzeige auf dem Bildschirm betreffen oder die Funktionsweise Ihrer Squeezebox oder Ihres Transporter &auml;ndern bzw. verbessern. Eine <a href="http://svn.slimdevices.com/repos/slim/7.3/tags/7.3/server/Changelog7.html"><span class="s2">vollst&auml;ndige Liste</span></a> ist verf&uuml;gbar.</p>



<ul>
  <li class="l1">SlimServer wurde im Angleich an die Produktnamen in SqueezeCenter umbenannt.</li>
  <li class="l1">SqueezeCenter hat eine vollst&auml;ndig neue Standardoberfl&auml;che. Die Einstellungen befinden sich auf einer Seite mit Registerkarten, was das Konfigurieren des Programms erleichtert.  Wenn Sie die &quot;alte&quot; Benutzeroberfl&auml;che von SlimServer 6.5.x bevorzugen, k&ouml;nnen Sie unter <b>http://<i>your server ip</i>:9000/classic</b> auf die Version &quot;Classic&quot; zugreifen.
  <li class="l1">SqueezeNetwork ist jetzt in SqueezeCenter integriert, Sie m&uuml;ssen also nicht mehr zwischen den beiden Anwendungen umschalten, um auf Internetdienste bzw. die lokale Musikbibliothek zuzugreifen.  Dienste wie Pandora Radio, Rhapsody oder Slacker Radio k&ouml;nnen jetzt direkt von einer Squeezebox oder einem Transporter, der mit SqueezeCenter verbunden ist, aufgerufen werden. </li>
  <li class="l1">Die Synchronisierung von mehreren Ger&auml;ten (Squeezebox oder Transporter) wurde v&ouml;llig umgestaltet und verbessert.</li>
  <li class="l1">Die Unterst&uuml;tzung SqueezeOS basierender Ger&auml;te wurde hinzugef&uuml;gt.  (SqueezeOS wurde bisher &quot;Jive-Software-Plattform&quot; genannt.)</li>
  <li class="l1">Die Plug-In-Architektur wurde umgestaltet, um eine robuste, konsistente Oberfl&auml;che zu schaffen.  Der Nachteil ist, dass die Plug-Ins aus SlimServer 6.5.x von ihren Entwicklern aktualisiert werden m&uuml;ssen, damit sie mit SqueezeCenter kompatibel sind.  Informationen zu SqueezeCenter-Plug-Ins finden Sie <a href="http://wiki.slimdevices.com/index.php/SqueezeCenter_Plugins"><span class="s2">hier</span></a>.</li>
</ul>


<p class="p4"><a NAME="ServiceMode">Ausf&uuml;hren von SqueezeCenter als Windows-Dienst</a></p>
<p class="p3">Standardm&auml;&szlig;ig wird SqueezeCenter jetzt im Anwendungsmodus ausgef&uuml;hrt und beim Anmelden bei Windows gestartet.  SqueezeCenter kann so auf Ihre  iTunes-Bibliothek, freigegebenen Order oder Netzwerklaufwerke zugreifen, ohne dass sich die Funktionsweise &auml;ndert.  Wenn Sie SqueezeCenter als Windows-Dienst im Hintergrund ausf&uuml;hren m&ouml;chten, m&uuml;ssen Sie die Funktion <b>SqueezeCenter-Dienst aktivieren</b> ausf&uuml;hren.  W&auml;hlen Sie im Windows-Startmen&uuml; im SqueezeCenter-Programmordner die Option <b>Startup Manager</b>.</p>
<ul>
  <li class="l1">W&auml;hlen Sie die Option <b>&quot;SqueezeCenter automatisch beim Systemstart starten.&quot;</b>, um SqueezeCenter als Dienst zu installieren.</li>
  <li class="l2">W&auml;hlen Sie die Option <b>&quot;SqueezeCenter beim Anmelden starten&quot;</b>, um SqueezeCenter als Anwendung auszuf&uuml;hren (Standardeinstellung).</li>
</ul>
<p class="p3">Wenn Sie SqueezeCenter als Dienst im Hintergrund ausf&uuml;hren, m&uuml;ssen Sie Windows-Benutzername und Kennwort eingeben, damit SqueezeCenter auf Ihre iTunes-Bibliothek, freigegebenen Ordner oder Netzwerklaufwerke zugreifen kann.  Klicken Sie auf <b>Weiter</b>, um die &Auml;nderungen zu &uuml;bernehmen und die Anwendung zu beenden.  Sie m&uuml;ssen Windows neu starten, um den Vorgang abzuschlie&szlig;en.</p>


<a NAME="Firmware"><p class="p4">Aktualisieren der Firmware</a></p>
<p class="p3">Wenn Sie eine Squeezebox oder einen Transporter haben, werden Sie eventuell aufgefordert, die Firmware zu aktualisieren, wenn zum ersten Mal eine Verbindung zu SqueezeCenter hergestellt wird. Halten Sie die Brightness-Taste auf der Fernbedienung gedr&uuml;ckt, bis das Aktualisieren der Firmware gestartet wird.</p>


<a NAME="RemoteProblem"><p class="p4">Eingeben eines WPA-Kennworts &uuml;ber die Fernbedienung</p></a>
<p class="p3">Bestimmte Handb&uuml;cher f&uuml;r die Squeezebox und den Transporter enthalten einen Fehler im Abschnitt zu WPA-Kennw&ouml;rtern.  Laut Handbuch m&uuml;ssen Sie zum Einf&uuml;gen eines Zeichens PLAY und zum L&ouml;schen eines Zeichens ADD dr&uuml;cken.  Das Gegenteil ist der Fall:  ADD f&uuml;gt ein Zeichen ein und PLAY l&ouml;scht eines.</p>


<p class="p4"><a NAME="iTunes">Unterst&uuml;tzung von iTunes-Bibliotheken</a></p>
<p class="p3">Wenn Sie Apple iTunes zum Verwalten Ihrer Musik nutzen, importiert SqueezeCenter automatisch Daten aus Ihrer iTunes-Bibliothek. Wenn Sie Musik zu iTunes hinzuf&uuml;gen oder daraus entfernen, erkennt SqueezeCenter die &Auml;nderung und durchsucht die Bibliothek erneut.  Sie k&ouml;nnen den Zeitraum zwischen den Pr&uuml;fungen in der SqueezeCenter-Web-Benutzeroberfl&auml;che unter 'Einstellungen' auf der Registerkarte 'iTunes' festlegen.</p>
<p class="p8">Soll SqueezeCenter die iTunes-Datenbank nicht nutzen, m&uuml;ssen Sie die Einstellung in der SqueezeCenter-Web-Benutzeroberfl&auml;che unter 'Einstellungen' auf der Registerkarte 'iTunes' &auml;ndern.  Sie m&uuml;ssen den Ordner angeben, in dem Ihre Musikdateien und Wiedergabelisten gespeichert sind, und dann auf der Registerkarte &quot;Grundeinstellungen&quot; auf &quot;Musiksammlung durchsuchen&quot; klicken.</p>

<p class="p4">Hinweis zu im iTunes Music Store erworbenen Titeln</p>
<p class="p3">Da Apple die meisten im iTunes Music Store erworbene Titel mit einem Kopierschutz (Digital Rights Management, DRM) versieht, sind die Benutzerrechte an diesen Dateien eingeschr&auml;nkt. Ein wichtiges Recht, das von Apple nicht gew&auml;hrt wird, ist die Wiedergabe auf einem nicht von Apple zur Verf&uuml;gung gestellten Musikger&auml;t (mit Ausnahme des Computers, auf dem der Titel erworben wurde). Erst wenn Apple seine Haltung gegen&uuml;ber der Lizenzierung &auml;ndert oder FairPlay abschafft, k&ouml;nnen Sie diese Titel auf der Squeezebox oder dem Transporter wiedergeben.</p>

<p class="p4">Manche Titel aus der iTunes-Bibliothek werden in SqueezeCenter nicht angezeigt oder k&ouml;nnen nicht ge&ouml;ffnet werden</p>
<p class="p3">Wenn Sie Ihre iTunes-Musikdateien verschoben haben, exportiert iTunes unter Umst&auml;nden falsche Informationen. Sie m&uuml;ssen sicherstellen, dass iTunes den richtigen Ordner f&uuml;r Ihre Musikbibliothek nutzt.</p>
<p class="p3">Klicken Sie in den iTunes-Einstellungen auf Erweitert. Ist der Pfad zu Ihrer Musikbibliothek falsch, m&uuml;ssen Sie ihn korrigieren. Ist er korrekt, w&auml;hlen Sie einen anderen Ordner und anschlie&szlig;end wieder den korrekten Ordner. iTunes aktualisiert dann die Pfade zur gesamten Musiksammlung und exportiert diese Daten korrekt. Bei diesem Vorgang werden keine Musikdateien verschoben, sondern iTunes wird gezwungen, die Musikbibliothek zu durchsuchen und die Pfade zu den Titeln zu aktualisieren.</p>
<p class="p3">Bleibt das Problem weiterhin bestehen, wurden m&ouml;glicherweise die iTunes-Einstellungen &quot;iTunes Musik-Ordner verwalten&quot; und &quot;Dateinamen mit Titelnummer erstellen&quot; ge&auml;ndert. &Auml;ndern Sie diese Einstellungen und stellen Sie anschlie&szlig;end den vorherigen Zustand wieder her, damit iTunes die aktuellen Informationen &uuml;ber Ihre Musikdateien aktualisiert. Beachten Sie, dass beim Ordnen der Musikdateien durch iTunes die Dateien selbst eventuell verschoben oder umbenannt werden.</p>


<p class="p4"><a NAME="Streaming">Streaming-Wiedergabe &uuml;ber das Internet</a></p>
<p class="p3">SqueezeCenter wurde zur &Uuml;bertragung von MP3-Musik auf eine Squeezebox, einen Transporter oder SLIMP3 Network Music Player entwickelt. Au&szlig;erdem kann es dieselbe Musik &uuml;ber das Internet an einen beliebigen Software-Player, der MP3-Streams unterst&uuml;tzt, &uuml;bertragen.</p>
<p class="p3">Installieren Sie zuerst SqueezeCenter und vergewissern Sie sich, dass der als Server zu nutzende Computer &uuml;ber das Internet erreichbar ist. Ist dies nicht der Fall, m&uuml;ssen Sie Anschluss 9000 auf dem Router zum SqueezeCenter-Computer &ouml;ffnen (Anweisungen hierzu finden Sie in der Dokumentation zum Router). Dann:</p>
<ul>
  <li  class="l1">&Ouml;ffnen Sie folgenden Stream im Software-MP3-Player: <a href="http://localhost:9000/stream.mp3"><span class="s2">http://localhost:9000/stream.mp3</span></a>. Ersetzen Sie dabei &quot;localhost&quot; durch die IP-Adresse des SqueezeCenter-Computers. Wenn Sie SqueezeCenter durch ein Kennwort gesch&uuml;tzt haben, m&uuml;ssen Sie die URL wie folgt anpassen: <a href="http://username:password@localhost:9000/stream.mp3"><span class="s2">http://Benutzername:Kennwort@localhost:9000/stream.mp3</span></a>. Bei bestimmten MP3-Playern werden Sie aufgefordert, Benutzername und Kennwort einzugeben.</li>
  <li  class="l1">&Ouml;ffnen Sie die Web-Benutzeroberfl&auml;che von SqueezeCenter auf dem Remote-Computer, indem Sie die Seite <a href="http://localhost:9000/"><span class="s2">http://localhost:9000</span></a> aufrufen (ersetzen Sie &quot;localhost&quot; durch die IP-Adresse des Remote-Computers). Es wird ein neuer &quot;Player&quot; entsprechend der IP-Adresse des Computers mit dem MP3-Software-Player angezeigt.</li>
  <li  class="l1">Suchen Sie auf der linken Seite der SqueezeCenter-Web-Benutzeroberfl&auml;che nach Musikdateien und w&auml;hlen Sie die gew&uuml;nschten aus. Ausgew&auml;hlte Eintr&auml;ge werden auf der rechten Seite angezeigt.</li>
  <li  class="l1">Klicken Sie auf der rechten Seite der SqueezeCenter-Web-Benutzeroberfl&auml;che auf &quot;Wiedergabe&quot;, um die Musik zu starten.</li>
  <li  class="l1">Nach wenigen Sekunden wird die Musik &uuml;ber den MP3-Software-Player ausgegeben. Die Verz&ouml;gerung entsteht durch Puffern in der MP3-Player-Software.</li>
  <li  class="l2">Verwenden Sie die SqueezeCenter-Web-Benutzeroberfl&auml;che auf dem Remote-Computer, wenn Sie andere Inhalte wiedergeben m&ouml;chten.</li>
</ul>
<p class="p2">Copyright 2003-2008, Logitech, Inc. Alle Rechte vorbehalten.</p>
</body>
</html>
