<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
  <meta http-equiv="Content-Style-Type" content="text/css">
  <title>
	Introducci&oacute;n a SqueezeCenter, versi&oacute;n 7.2.1

  </title>
  <meta name="Generator" content="Cocoa HTML Writer">
  <meta name="CocoaVersion" content="824.42">
  <style type="text/css">
    h1 {margin: 0.0px 0.0px 7.0px 0.0px; text-align: center; font: 11.0px Verdana; font-weight: bold; color: #dd3e25}
    p.p1 {margin: 0.0px 0.0px 7.0px 0.0px; text-align: center; font: 11.0px Verdana; color: #dd3e25}
    p.p2 {margin: 0.0px 0.0px 11.0px 0.0px; text-align: center; font: 11.0px Verdana; color: #333333}
    p.p3 {margin: 0.0px 0.0px 11.0px 0.0px; font: 11.0px Verdana; color: #333333}
    p.p4 {margin: 20.0px 0.0px 5.0px .0px; font: 11.0px Verdana; font-weight: bold; color: #333333}
    p.p5 {margin: 0.0px 0.0px 0.0px 0.0px; font: 11.0px Verdana; color: #333333}
    p.p6 {margin: 0.0px 0.0px 6.0px 0.0px; font: 12.0px Verdana; min-height: 14.0px}
    p.p7 {margin: 0.0px 0.0px 0.0px 0.0px; font: 11.0px Verdana; color: #333333; min-height: 13.0px}
    p.p8 {margin: 0.0px 0.0px 0.0px 0.0px; font: 11.0px Verdana}
    p.p9 {margin: 0.0px 0.0px 0.0px 0.0px; font: 12.0px Verdana; min-height: 14.0px}
    span.s1 {text-decoration: underline}
    span.s2 {text-decoration: underline ; color: #0020de}
    li.l1 {margin: 0.0px 0.0px 3.0px 0.0px; font: 11.0px Verdana; color: #333333}
    li.l2 {margin: 0.0px 0.0px 11.0px 0.0px; font: 11.0px Verdana; color: #333333}
  </style>
</head>
<body>

<h1>Introducci&oacute;n a SqueezeCenter</h1>
<p class="p2">Versi&oacute;n 7.2.1</p>


<p class="p3">Gracias por descargar la versi&oacute;n m&aacute;s reciente de SqueezeCenter para Microsoft Windows. Puede desplazarse hacia abajo o hacer clic en los v&iacute;nculos siguientes para obtener informaci&oacute;n sobre cada tema.</p>
<ul>
  <li class="l1"><span class="s1"><a href="#Install">Instalaci&oacute;n de SqueezeCenter</a></span></li>
  <li class="l1"><span class="s1"><a href="#WhatsNew">Novedades</a></span></li>
  <li class="l1"><span class="s1"><a href="#ServiceMode">Ejecuci&oacute;n de SqueezeCenter como servicio</a></span></li>
  <li class="l1"><span class="s1"><a href="#Firmware">Actualizaci&oacute;n de firmware</a></span></li>
  <li class="l1"><span class="s1"><a href="#RemoteProblem">Introducci&oacute;n de una contrase&ntilde;a WPA con el mando a distancia</a></span></li>
  <li class="l1"><span class="s1"><a href="#iTunes">Informaci&oacute;n sobre iTunes</a></span></li>
  <li class="l2"><span class="s1"><a href="#Streaming">Reproducci&oacute;n por secuencias mediante Internet</a></span></li>
</ul>
<p class="p3">Si tiene alg&uacute;n problema o desea hacer una pregunta, consulte la interfaz Web de SqueezeCenter, o consulte las <a href="http://slimdevices.custhelp.com/cgi-bin/slimdevices.cfg/php/enduser/std_alp.php"><span class="s2">preguntas m&aacute;s habituales</span></a>, visite nuestro foro de usuarios en <a href="http://forums.slimdevices.com/"><span class="s2">http://forums.slimdevices.com/</span></a> o p&oacute;ngase en contacto con nuestro equipo de asistencia t&eacute;cnica en <a href="mailto:support@slimdevices.com"><span class="s2">support@slimdevices.com</span></a>.</p>
<p class="p3">Gracias.</p>
<p class="p3">El equipo de sistemas para transmisi&oacute;n multimedia por secuencias de Logitech</p>


<a NAME="Install"><p class="p4">Instalaci&oacute;n</p></a>
<p class="p3">Para instalar SqueezeCenter, haga doble clic en el <b>instalador de SqueezeCenter</b> y siga las instrucciones en pantalla. El instalador indicar&aacute; la finalizaci&oacute;n del proceso de instalaci&oacute;n. SqueezeCenter para Windows se instala de forma predeterminada como una aplicaci&oacute;n (encontrar&aacute; detalles sobre la ejecuci&oacute;n de SqueezeCenter como servicio <span class="s1"><a href="#ServiceMode">aqu&iacute;</a></span>). Haga doble clic en el icono de SqueezeCenter en la bandeja del sistema de Windows para iniciar la interfaz Web de SqueezeCenter.</p>
<p class="p3">La primera vez que ejecute la interfaz Web, un asistente le guiar&aacute; en el proceso de configuraci&oacute;n de SqueezeCenter para su sistema.</p>
<p class="p3">Si va a actualizar a SqueezeCenter una instalaci&oacute;n existente de SlimServer, se conservar&aacute; la configuraci&oacute;n anterior de SlimServer. Ahora bien, debido a los cambios realizados en la arquitectura de los complementos, tendr&aacute; que descargar e instalar versiones actualizadas de los complementos. La configuraci&oacute;n espec&iacute;fica de los complementos no se conservar&aacute;. Para obtener informaci&oacute;n sobre complementos, visite <a href="http://wiki.slimdevices.com/index.php/SqueezeCenter_Plugins"><span class="s2">nuestro wiki</span></a>.</p>
<p class="p3">La informaci&oacute;n sobre el uso de SqueezeCenter est&aacute; disponible en SqueezeCenter: seleccione el icono de ayuda situado en la esquina inferior izquierda de la interfaz Web.</p>


<a NAME="WhatsNew"><p class="p4">Novedades en 7.2.1</p></a>
<p class="p3">Tambi&eacute;n hay disponible una <a href="http://wiki.slimdevices.com/index.php/7.2.1_Release_Notes"><span class="s2">lista</span></a> de cambios.</p>


<a NAME="ServiceMode"><p class="p4">Ejecuci&oacute;n SqueezeCenter como servicio</a></p>
<p class="p3">De forma predeterminada, SqueezeCenter se ejecuta ahora en modo de aplicaci&oacute;n y se inicia al iniciar sesi&oacute;n en Windows. As&iacute; SqueezeCenter puede acceder a la biblioteca de iTunes, las carpetas compartidas o las unidades de red sin ning&uacute;n cambio de comportamiento. Si desea que SqueezeCenter se ejecute como servicio en segundo plano en Windows, deber&aacute; ejecutar el <b>Habilitador de servicios de SqueezeCenter</b>. En el men&uacute; Inicio de Windows, seleccione SqueezeCenter y <b>Administrador de inicio</b>.</p>
<ul>
  <li class="l1">Para ejecutar SqueezeCenter como servicio, seleccione <b>&quot;Iniciar SqueezeCenter autom&aacute;ticamente al iniciarse el sistema.&quot;</b> As&iacute; SqueezeCenter se instalar&aacute; como servicio.</li>
  <li class="l2">Para ejecutar SqueezeCenter como aplicaci&oacute;n, seleccione <b>&quot;Iniciar SqueezeCenter al iniciar sesi&oacute;n&quot;.</b> As&iacute; SqueezeCenter se ejecutar&aacute; como aplicaci&oacute;n (la configuraci&oacute;n predeterminada).</li>
</ul>
<p class="p3">Si ejecuta SqueezeCenter como servicio en segundo plano, tendr&aacute; que introducir el nombre de usuario y la contrase&ntilde;a de Windows para permitir que SqueezeCenter acceda a la biblioteca de iTunes, las carpetas compartidas o las unidades de red. Use el bot&oacute;n <b>Siguiente</b> para aceptar los cambios y cerrar la aplicaci&oacute;n. Deber&aacute; reiniciar Windows para que los cambios entren en vigor.</p>


<a NAME="Firmware"><p class="p4">Actualizaci&oacute;n de firmware</a></p>
<p class="p3">Si posee un dispositivo Squeezebox o Transporter, le pueden pedir que actualice el firmware cuando se conecte por primera vez a SqueezeCenter. Mantenga presionado el bot&oacute;n Brightness del mando a distancia hasta que comience la actualizaci&oacute;n del firmware.</p>


<a NAME="RemoteProblem"><p class="p4">Introducci&oacute;n de una contrase&ntilde;a WPA con el mando a distancia</p></a>
<p class="p3">Algunas versiones de los manuales del usuario de Squeezebox y Transporter tienen un error en la secci&oacute;n sobre contrase&ntilde;as WPA. Seg&uacute;n el manual, se utiliza el bot&oacute;n PLAY para insertar un car&aacute;cter en la cadena de la contrase&ntilde;a y ADD para eliminarlo. En realidad es al rev&eacute;s. Lo correcto es usar ADD para insertar un car&aacute;cter y PLAY para eliminarlo.</p>


<a NAME="iTunes"><p class="p4">Compatibilidad con biblioteca de iTunes</a></p>
<p class="p3">Si usa iTunes de Apple para administrar la m&uacute;sica, SqueezeCenter importar&aacute; autom&aacute;ticamente la informaci&oacute;n de la biblioteca de iTunes. Si usa iTunes para agregar o quitar m&uacute;sica de la biblioteca, SqueezeCenter detectar&aacute; el cambio y volver&aacute; a examinar la informaci&oacute;n de canci&oacute;n. Puede configurar el intervalo entre comprobaciones en la interfaz Web de SqueezeCenter, en Configuraci&oacute;n y en la ficha iTunes.</p>
<p class="p8">Si no desea que SqueezeCenter use su base de datos de iTunes, debe cambiar esa opci&oacute;n en la interfaz Web de SqueezeCenter, en Configuraci&oacute;n y en la ficha iTunes. Deber&aacute; especificar la carpeta en la que desea guardar la m&uacute;sica y las listas de reproducci&oacute;n. A continuaci&oacute;n, en la ficha Configuraci&oacute;n b&aacute;sica, deber&aacute; seleccionar Volver a examinar para que se inicie un examen de la m&uacute;sica,</p>

<p class="p4">Nota sobre las canciones adquiridas en iTunes Music Store</p>
<p class="p3">Como Apple usa Administraci&oacute;n de derechos digitales (DRM) en la mayor&iacute;a de las canciones que vende en iTunes Music Store, estos archivos proporcionan unos derechos de usuario limitados. Un derecho importante que Apple no otorga es el de reproducir una pista en un dispositivo de m&uacute;sica que no sea proporcionado por Apple (con la excepci&oacute;n del ordenador desde el que se adquiri&oacute; la pista). Mientras Apple no cambie su posici&oacute;n en cuanto a licencias o elimine FairPlay, usted no podr&aacute; reproducir estas pistas en Squeezebox o Transporter.</p>

<p class="p4">Algunas de las canciones de la biblioteca de iTunes no aparecen en SqueezeCenter o no se pueden abrir</p>
<p class="p3">Si ha movido los archivos de m&uacute;sica de iTunes, iTunes puede exportar informaci&oacute;n incorrecta sobre las canciones en su biblioteca. Deber&aacute; comprobar que iTunes tenga la carpeta correcta para la biblioteca de m&uacute;sica.</p>
<p class="p3">Visite las Preferencias de iTunes y haga clic en Avanzado. Si la ruta a la carpeta de la biblioteca de m&uacute;sica no es correcta, deber&aacute; corregirla. Si es correcta, intente cambiarla a otra carpeta y luego volver a cambiarla a la carpeta correcta. iTunes actualizar&aacute; entonces las rutas a toda la m&uacute;sica y exportar&aacute; correctamente los datos. Este proceso no mover&aacute; la m&uacute;sica, sino que obligar&aacute; a iTunes a examinar la biblioteca de m&uacute;sica y actualizar las rutas de todas las canciones.</p>
<p class="p3">Si con esto no se resuelve el problema, iTunes se podr&iacute;a confundir si se cambian los par&aacute;metros Mantener organizada la carpeta iTunes Music o Crear nombres de archivo con n&uacute;meros de pista en iTunes. Cambie estos par&aacute;metros y luego vuelva a cambiarlos para que iTunes actualice la informaci&oacute;n correcta sobre los archivos de m&uacute;sica. Tenga en cuenta que, para que iTunes organice los archivos de m&uacute;sica, quiz&aacute;s sea preciso mover los archivos o cambiarles el nombre.</p>


<a NAME="Streaming"><p class="p4">Reproducci&oacute;n por secuencias mediante Internet</a></p>
<p class="p3">SqueezeCenter se ha dise&ntilde;ado para transmitir por secuencias m&uacute;sica en formato MP3 a un reproductor de m&uacute;sica en red Squeezebox, Transporter o SLIMP3. Tambi&eacute;n puede transmitir por secuencias mediante Internet la misma m&uacute;sica a cualquier software reproductor que admita la transmisi&oacute;n por secuencias de MP3.</p>
<p class="p3">Instale primero SqueezeCenter y compruebe que se puede acceder por Internet al ordenador que se utilizar&aacute; como servidor. De lo contrario, deber&aacute; dirigir el puerto 9000 del enrutador al ordenador que ejecute SqueezeCenter. Consulte la documentaci&oacute;n del enrutador para obtener instrucciones al respecto. A continuaci&oacute;n:</p>
<ul>
  <li  class="l1">Use el software reproductor de MP3 para abrir una secuencia en la URL: <a href="http://localhost:9000/stream.mp3"><span class="s2">http://host_local:9000/stream.mp3</span></a>. Sustituya &quot;host_local&quot; por la direcci&oacute;n IP del ordenador que ejecute SqueezeCenter. Si usa la seguridad mediante contrase&ntilde;a de SqueezeCenter, deber&aacute; usar una URL ligeramente modificada, como: <a href="http://username:password@localhost:9000/stream.mp3"><span class="s2">http://nombre_de_usuario:contrase&ntilde;a@host_local:9000/stream.mp3</span></a>. Algunos reproductores le pedir&aacute;n que introduzca un nombre de usuario y una contrase&ntilde;a.</li>
  <li  class="l1">Para abrir la interfaz Web de SqueezeCenter en el ordenador remoto, abra la p&aacute;gina Web <a href="http://localhost:9000/"><span class="s2">http://host_local:9000</span></a> (sustituya &quot;host_local&quot; por la direcci&oacute;n IP del ordenador remoto). Ver&aacute; un &quot;reproductor&quot; nuevo correspondiente a la direcci&oacute;n IP del ordenador con el software reproductor de MP3.</li>
  <li  class="l1">Use el panel izquierdo de la interfaz Web de SqueezeCenter para explorar y seleccionar la m&uacute;sica que se reproducir&aacute;. Al seleccionar la m&uacute;sica, aparecer&aacute; en el panel derecho de la interfaz Web.</li>
  <li  class="l1">Haga clic en el bot&oacute;n Reproducir en el panel derecho de la interfaz Web de SqueezeCenter para iniciar la reproducci&oacute;n de la m&uacute;sica.</li>
  <li  class="l1">Tras un par de segundos, escuchar&aacute; la m&uacute;sica mediante el software reproductor de MP3. El retardo se debe al almacenamiento en b&uacute;fer del software reproductor de MP3.</li>
  <li  class="l2">Para cambiar el contenido que se reproduce, utilice la interfaz Web de SqueezeCenter en el equipo remoto.</li>
</ul>
<p class="p2">Copyright 2003-2008, Logitech, Inc. Reservados todos los derechos.</p>
</body>
</html>
